app/views/posts/index.html.erb

<% Post.all.each do |post|%>
---
SELECT "posts".* FROM "posts"